[{"id":"1631332987333","title":"Italy Volume V","category":"Travel","location":"Naples","content":"Okay, so Monday was a full day. I went to Ercolano (Herculaneum in English I think) which is close to Pompeii and has similar excavation things to see. It is a much smaller city than Pompeii, but it was also buried by the same volcano, so it’s all done up in similar fashion. I’ll send pictures. I only spent the morning there. I had lunch and went to Caserta to see La Reggia (the Palace). There was a huge palace built there in the 1800s or something like that and it’s got this backyard fit for a king. It’s about 3 or 4 km deep and about goes from 200 m to nearly a km wide in some places. It’s got this great big fountain at the very top of the hill (which is at the very end of the back yard, so the furthest from the palace). And then it had this running manmade river/fountain/pond thing straight down the middle of the yard with little fishies and waterfalls to make it look beautiful. I’ve taken some pictures, but my battery died before I got to the top. You’ll have to look it up online. I headed home to see my friend Marco at the gelateria and then go to bed. It was a great day 🙂\n\nTuesday I went to the Amalfi coast, and I can’t wait to tell all of you what a great time I had!\nI woke up early enough to pack up things because I had to change rooms in my hostel. I left all of my luggage in the luggage room for safekeeping and brought with me a towel, my camera, and some food. I took the Circumvesuviana train to Sorrento where I got on a bus for Amalfi. It stopped in Positano along the way. For those of you who have never experienced the bus ride in the mountains, here is a detailed explanation. You get on this rather comfortable bus, the\nkind that have cushioned chairs for long-distance travel. You’re supposed to purchase the ticket before you get on the bus, or you can’t get on. I’m fortunate to catch the bus immediately as it is about to depart and we are off…two Italian ragazzacci on the bus ask him to stop 2 meters after departure to let two girls on the bus. The girls are British and haven’t purchased a ticket yet. The way the boys said it, I thought they were friends with them, but really, they just saw them rushing to the bus and thought they were hot, so he asked to let them get on too. I figured this out because I could hear their entire conversation all the way to Positano. \n\nSo, the bus finally goes and it’s literally like a roller coaster ride. We’re riding up the mountain and down the mountain twisting and turning the whole way. My eyes are glued in front of me as I get very sick very easily from this type of uncontrolled motion. Now this seems crazy enough as it is, but most of you are picturing large spacious roads that we’re driving on because you’re in America where they exist.  No.  These roads are probably as big as an alley-way one-way road in America, but there are cars parked on at least one side or sometimes both and there are cars going both ways. So the bus got stuck a million times and honked its horn the whole way to warn others that it was coming around a tight corner and of course the bus has to take wide turns…when the wide turn doesn’t exist, you fear you’ll just go over the edge. nearly 2 hours later I arrive in Amalfi and kiss the ground upon exit from the vehicle. I immediately head for the beach as I am very excited to start catchin' some rays and swim around with my under-water capable camera. 🙂\n\nSo, I’m on the beach and it’s SO full of people…I’ve got pictures, don’t worry. I walk all the way to the other side of the beach to climb on the rocks and swim around to a rocky grotto around a bend. There I meet this guy from Holland with a mask and snorkel that he lets me borrow because he is intrigued by my camera. 🙂 So, I have a blast for about an hour swimming around taking underwater pictures and just above the water pictures (I’ll share soon). Anyway, so this guy tells me that I should take the metro del mare (metro of the sea) to get back instead of the crazy bus because the trip back is worse. So, I do. And what a beautiful trip that was! All along the Amalfi coast I was on a boat and I got front-row seats right by the edge. My camera’s battery ran out before I could get all the pictures that I wanted, but it was beautiful just the same. I got home close to 10 because my travels ended in a long walk to the train station because I went the wrong way (oops) and walked to a whole new town to catch the train. So, I was definitely tired by the end of the day.\n\nThe next day I went to Vico Erquense to find a beach there. Apparently it’s called Turtle Beach (like Myrtle Beach only different) or something like that (spiaggia della tortaruga in Italian). But I don’t think I found it…I just found a beach nearby and enjoyed the sun and surf…well, no surfing for me…I don’t know where the surfing beaches are in Italy if there are any, so I’m content with my little swimming beach coves. I’m getting much needed sun and enjoying the relaxation that it offers me. In the evening I went to my favorite gelateria and Marco and I planned an afternoon/evening in Naples eating a pizza and checking out lungomare and other sights in downtown Naples.\n\nThursday, I went to the beach in the morning (just the one near the hostel) to catch some rays and then in the afternoon I met Marco and we went to his house where I met his mother and had some fresh squeezed lemonade from their garden. They are the coolest people!\n\nMarco’s sister is visiting Japan right now, but they offered to let me stay with them any time I ever come back to Italy…for free! I love napoletani! Anyway, then we went to Napoli Centro to see lungomare and eat a pizza. We had a blast chatting about all kinds of crazy things. I couldn’t get enough Italian. I felt Italian. I was walking around chatting in Italian for the first time I didn’t feel like everyone was looking at me thinking I don’t speak Italian. It was very cool. We were out until close to midnight and had to take the late buses home which took nearly 45 minutes to actually come. Marco’s took longer. He called me at 1:00 to tell me that the bus finally came.\n\nSo, I got to bed late, and even later in the night this crazy drunk guy comes into our room being all loud and obnoxious the ENTIRE night! He wouldn’t stop grumbling to himself and making noise with all his stuff. Then he left the room and came back about 20 minutes later with some people that had to lead him back to his room. I was very groggy because I just about fell asleep again. Anyway, I was up most of the night from his grumbling and snoring louder than anyone I’ve ever met in my life! (even people in my family…so that’s pretty bad!) Now I’m off to nap on the beach and catch more rays.","image":"uploads/image-1631332987313undefined","date_added":"August 27, 2006"},{"id":"1","title":"My adventure begins!","category":"Travel","location":"Brazil","content":"So, it all started with a fairly simple plain ride to Sao Paulo. It was an overnight flight, so I slept most of the way. Once we got to Brazil, the delay was in the flight to Porto Alegre -- it’s in the very south of Brazil. We arrived around 4:30 and after unloading our stuff and checking in we went to a grocery store to grab some food and things to keep in our fridges in our rooms. Everyone has a roommate except me because the only other guy on the trip opted to pay the extra for the single room leaving me in a single room without having to pay extra. 🙂  \n\n Anyway, at the grocery store, as we were leaving, we were all in the van that was rented to drive us around and these two guys walked by one of which caught the attention of several girls on the bus who yelled some 'woohoos' and 'ow ows' out the window at him. He turns and starts blowing kisses and drawing air-hearts and as soon as the professor returned so we could leave they asked him how to say, \"take your clothes off\" in Portuguese. So, that’s one of the first phrases I learned. \n\nThat night we went to this buffet style pizza place where they keep bringing out different kinds of pizzas and give you a slice if youwant to eat it. After the dinner pizzas were the desert pizzas, and they were DELICIOUS. My favorite was painted with chocolate and topped with fresh strawberries. I was also introduced to a very delicious drink called guaranà. It tastes a little like gingerale with a hint of strawberry or some other fruity flavor. Maybe it’s most like a shirley temple, but a little sweeter. Guaranà is a fruit. The label mentions nothing of caffeine, so I felt there was no harm in drinking it especially when I discovered guaranà zero was just as delicious, so I began to drink it like water. \n\nTwo days later I came down with the worst diarrhea right when we got to a preschool in the outskirts of the town. Three times in 2 hours I visited the restroom and on the 3rd time they directed me to my own private stall. The embarrassment continued to mount as the LBM issues continued for the next three days. I avoided dairy altogether drugged up on Immodium, pepto and tums, but still couldn’t kick the problem until one of my other professors tells me that guaranà is loaded with caffeine and probably wouldn’t be good for my bowel issues. Basically, this drink is a much better tasting Red Bull. I immediately quit drinking it and suddenly returned to normal…but I did have to suffer through the caffeine withdrawal headaches…it was a veritable Mormon detox. Don’t worry, Mom…I survived 😉 \n\nPorto Alegre is not like most of Brazil. It’s a bit more liberal and much more politically active than the rest of the country. We visited schools and programs that were very indicative of this fact, but one in particular I would like to share. An old factory that made corks for wine bottles was converted into an art gallery for people to browse for free. All of the art is politically driven and right on the outside is a very tall tower (probably about 500 feet tall) that every year on AIDS day they wrap in a very large condom to make a statement about safe sex. I don’t know how they get it on, but Fernando (the Brazilian professor in charge of our program) tells us it’s really made of rubber because he touched it one year. \n\nI wasn’t quite livin’ it up down in Porto Alegre. It was kinda like being in Provo, UT with no car. There’s not much to do at night, and nothing is in walking distance from the hotel. Also, it’s close to 40 degrees and all I brought was beachwear. We were originally told to bring a light jacket cause it might be cold, after all it is winter down here, but none of us were prepared for the need for scarves and gloves. Fortunately, everything I got to see was worth the trip. \n\nThe poverty level in the country is immense but there are amazing programs for turning that around, and some incredibly driven and courageous people who started them. One in particular started a recycling program collecting all the recycling materials from the city and sorting them to be taken to recycling centers. The money raised goes to the women who work there and to programs for educating those women and their children. Most of these women were prostitutes who were taken out of their situation in order to learn to be strong women instead of weak and subservient to men. It was a very moving and inspiring visit.","image":"uploads/portoallegre.jpeg","date_added":"July 4, 2007"},{"id":"2","title":"The adventure continues...","category":"Travel","location":"Brazil","content":"Are you ready for another installment of Dan does Brazil? This week’s episode finds me in Rio de Janeiro!!! Thank you to those who complimented my amazing Portuguese. A week later, I’m proud to say I can do more than ask where the bathroom is and tell someone to take his clothes off. \n\nPreface: I came to Brazil with 22 other NYU students and 3 professors (one brought his daughter). One professor left with his daughter after Porto Alegre, leaving us as a group of 25 – 22 + me + 2 professors. Of the 22, 3 others are from my program: Maria, Jane and Kate, and only one other student is male. This is important as I will mention names this blog so now you have a point of reference. Jane and I have hit it off amazingly well. Our personalities mesh very well, and though we’ve attempted to avoid being cliquey or exclusive, I’ll admit we’ve spent an abundant amount of time together. \n\nBefore we left Porto Alegre, we had one final dinner with everyone in the group and some of Fernando’s family because he’s from Porto Alegre. It was a great night with way too much eating and drinking, but still lots of fun. My camera is waterproof up to ten feet, and no one believed me, so I filled a large glass with water dipped my camera in to show everyone at my table that it still worked. They all were shocked and appalled that I would do such a thing, and I was so amused that I decided to play a prank on my professor, Fernando. I walked over to his table with my friend Jane as my accomplice. I was holding the camera while she brought the large glass of water and placed it on the table next to him without him realizing it. I came up to him asking to take a photo with him and then \"accidentally\" dropped the camera in the glass of water. Everyone at the table screamed! It was hilarious…I took the camera out trying to calm everyone down saying it’s okay, but they were all so shocked that they didn’t know what to do (I have a picture of Fernando’s brother with the most disheartened and flabbergasted look on his face). So, I dropped the camera in again and the entire table screamed again and looked at me as though I’d gone insane. I therefore couldn’t resist dropping it in again just to see if the scream would be as loud. After the third time, Fernando made me stop because he almost had a heart attack thinking I’d ruined my camera. I love practical jokes. \n\nAirport Hell: Cold, redundant Porto Alegre left the entire crew wanting for sunny Rio, so we all hopped into the van at 6:30 Saturday morning in order to catch our direct flight at 8 AM out of the town and into Rio within about 2 hours. When we arrived at the airport we waited in line for nearly an hour to discover that our flight to Rio was cancelled, so they’d redirect us on a flight around 10 AM to Sao Paulo and then to Rio from there. Geography lesson: that’s like flying from Chicago to New York through Texas. So in our elation we drudged our tired bodies to the waiting area to sleep and wait on airport-comfortable benches. When we finally got to Sao Paulo, our connecting flight, which was supposed to leave at 2:30, was cancelled as well. So, we were pushed to another flight leaving at 9 PM. The wait was excruciating, as I’m sure you all can imagine, but fortunately I had Jane. We arrived in Rio around midnight, exhausted and bitter toward airports. We told everyone that we got to Rio from Porto Alegre and it only took 2 Brazilian hours. \n\nJane and I decided in Porto Alegre that we wanted to go to a Karaoke place, but never got around to it. In our desire we decided to practice a duet that we could sing together at a Karaoke place just to pass away the time. So, I went online to research the worst duets of all time and narrowed it down to about 5, and I downloaded them onto my iPod. Now, in the airport Jane and I needed to fill our time with something, so we chose one of the songs to practice. We have spent the entire week in our free time practicing our choreography and harmonies. Don’t worry, we’re going to record it when we perform it and post it on YouTube for the whole world to see. \n\nRio is extremely beautiful and all the beaches are open to the public. Our hotel is a block from the CopaCabana beach and about a 15-minute walk to Ipanema (yes, being surrounded by women, I’ve sung 'the girl from Ipanema' about 100 times, and I only know 2 lines. We visited Sugar Loaf) two tall mountains/hills on the edge of Rio with beautiful views of the ocean and the city. I’ve been soaking up the sun’s rays since we got here and literally spent 6.5 hours at the beach on Friday and about 4 hours on Saturday. Jane, Kate, and I have become excellent body surfers. When we time the waves just right, it’s smooth sailing all the way to the shore. I’ve got the most incredible picture Jane took of me sailing right in on a wave. It’s worth all the sand in places sand shouldn’t be for that wave alone. Gotta love the beach! \n\nOn the fourth of July there were no fireworks, but Jane and I marched up to the roof where the hotel has a pool and a place to party singing the national anthem and waving mini American flags. We swam in the pool and played chicken fights in blow up donuts while chatting and taking pictures galore. I brought my camera along and dropped it in the pool (it’s also shock proof) just to give Fernando another little jolt. Needless to say, I’m becoming the prankster everyone wishes was not so mischievous. 😏 \n\nThe week was spent visiting schools and attending lectures. This week hasn’t been as eventful as Porto Alegre or admittedly as moving. But it has been slightly unnerving. We visited a high school that was literally like a prison. The whole place was concrete and nothing was posted on the walls in the classrooms. They all had fans in each room because there was no A/C. The teachers were dressed like they were going to the beach, and the students wandered from classroom to classroom with no discipline whatsoever. It was interesting to see an example of what doesn’t work. \n\nWe also visited a free school where students in favelas (Brazilian shantytowns) could go to learn a trade. They teach languages (Spanish, English, and Portuguese) computers, and arts. In the Arts school they teach students how to make costumes and stage scenery, and to put on make up for TV, film, or the stage. After their schooling, they find jobs in theaters and TV studios all over the city. I was extremely impressed with the Carneval costumes all over and the frames welded for floats in the Carneval parade.","image":"uploads/riobeach.jpeg","date_added":"July 8, 2007"},{"id":"3","title":"Brazil adventure part 3","category":"Travel","location":"Brazil","content":"This is my third and final blog since I leave Saturday night for NYC to return on Sunday morning. Airlines have been a bit crazy lately, so it’s probably pretty tentative when I actually get home 🙂 \n\nFriday night we went to this club with live music and three floors of rooms to enjoy, and it was a really cool place. Each section of every room highlighted some sort of object such as telephones, cash registers, tools, trays, etc. They were placed on the walls or in display cases as decoration. Outside was the main party strip in Rio where several bars, clubs and restaurants are filled with people and music. There was a main stage on the ground floor with a great band, but the dance area was a bit limited. Another floor had another live band playing and there was a much larger dance floor so a group of us danced there for most of the time since it was hopping. We got there pretty early, and stayed until nearly 1 AM soaking it all in. That was enough club for me though…I had to hand wash the cigarette smoke off of my clothes later that night. The club was very open though, much different than any club I’ve ever been to in America. There were open windows and open ceilings everywhere. \n\nSaturday night was probably the coolest night here in Rio. We went to the Live Earth concert. There were 8 cities around the world hosting a concert on all 7 continents including Antarctica (the scientists there put together a band to play their own little concert) in order to raise awareness for global warming. It was so packed with close to a million people, so we snuck around the beach side of the concert and watched from the side. There Pharrell, Macy Gray, and Lenny Kravitz performed along with several other Brazilian performers including O Rappa, who the crowd cheered for the most. Pharrell was awful! He’s a recording artist and not a live performer I guess, and the fact that he called the audience mother f@%&ers about 15 times really made the whole experience not such a delight. Macy Gray was cool, sexy and smooth. I enjoyed her the most. Lenny was Lenny and rocked the house. People enjoyed him, but they were dancing and throwing hands in the air mostly for O Rappa. \n\nOne of the girls in my group is getting married shortly after her return from Brazil, so all the girls decided they wanted to throw her a Bachelorette party at a nice restaurant near the hotel. Since I was the only guy available that night, they wanted to invite me as well, and you know me, I can’t resist a party. An hour or so before the event, I received a phone call from one of the party planners asking me to make her a man…for some reason I assumed that she wanted to dress as a man or have male clothes, so I said I’d see what I could do and to drop on by. She knocks on my door with a big poster board and asks me to draw a man so she could play pin the speedo on the hot stud. My artisitc ability leaves much to be desired, but I decided to accept the challenge. (check out the picture). There were 19 girls and me, and we had delicious food and played Pictionary with wedding related terms and another game with clay that you’ll have to ask me in person or on the phone to describe so as to avoid a scandalous e-mail. The best part of the whole event was the waiters who stripped for the girls after dinner was over, and even made out with one of the girls (not the bride to be). \n\nI have spent much more time at the beach of course and my tan is slowly developing. It’s been way too long since I’ve actually gotten sun, that my skin is working very slowly. I’m still the whitest guy on the beach most of the time. One increasingly annoying feature of Brazilian beaches is the presence of hundreds of vendors that walk up and down the beach selling sarongs, beer, sodas, ices, hats, shirts, etc. I’m not familiar with all beaches in the world, but I do remember last year in Italy this was not the case, so my suntanning is frequently interrupted by people in my face or blocking my sun while pushing their product. I did get my spidey tattoo this way, but now with the Pan-American games here, they’ve increased by hundreds more. In fact, at our final dinner inside a restaurant and several blocks away from the beach, this vendor came by the large window trying to sell us these zip-up purses. He was relentless. \n\nThis morning, as I was walking, I noticed this American walking with two other guys with a soccer ball in his hand. He was tossing it up a little bit and accidentally dropped it in front of this street cleaner who immediately caught it with his foot, dribbled it like a pro and knee-bumped it right back to the American’s hands. The look of shock on the American’s face was priceless. EVERY guy in Brazil can play soccer. Several of my classmates went to a game the other day and when they got back, we laughed about how much testosterone they had to bear while they were there. However, they were fortunate to learn every profane expletive that exists in Portuguese. \n\nLast night my friend Jane and I performed our YouTube-worthy Karaoke song for the entire study abroad group to tears and laughter. The funniest part was that the restaurant had 3 South Africans, and a crazy Brazilian who spoke English only in idiomatic expressions. So, we started the song, (we brought speakers and an iPod), and after the first line, he yells out, \"Oh, I want to DIE!\" with an expression of, \"What torture are they putting us through?\" It almost threw me off my game. Fortunately, we got it all on video, and as soon as I upload it, it will be available on YouTube.","image":"uploads/liveearth.jpeg","date_added":"July 14, 2007"},{"id":"4","title":"Brazil, the aftermath!","category":"Travel","location":"Brazil","content":"Okay, delayed reaction. I haven’t had Internet access since I returned from Brazil, but I had to send this out. Enjoy:\n\n This blog will be long and excruciatingly detailed. I thought my Brazil logs were over when I sent out my last blog post, but unfortunately the plane ride alone is worthy of it’s own blog. \n\nBackground: As I stated before, we were stuck in the São Paulo airport for the entire day on our trip to Rio from Porto Alegre. The airline we were traveling on is called Gol. \n\nJane has stayed behind to go to the Amazon along with many other students from the trip who are staying in Brazil for as long as they can. Eleven of us are scheduled to fly Gol at 4:10 PM to arrive in São Paulo at 5:20 PM. One girl is staying in São Paulo while the other ten of us are scheduled to fly Delta at 9:40 PM on a direct flight to NYC. Kate and I are discussing every possible way to get to NYC ASAP without having to deal with Gol. Before the bus came to take us to the airport we searched for direct flights from Rio to NYC, but to no avail, we were stuck on this Gol flight. According to the website updates, it was still scheduled to leave on time. \n\nWhen we arrive at 2:45 or so, Kate and I immediately take our luggage and head for the line because we’re used to it being fairly long. The other 9 trail behind and we all check in. The lady at the desk tells us the flight is delayed until 5:20 PM. While sitting at the gate, an announcement is made that the flight will be delayed until 6:30 PM. We’re now getting nervous and Meryl (the girl who kept Gol on their toes the last time we were stuck in the airport) goes to speak with someone who speaks English to tell them that we need to get to São Paulo in time to catch out flight. We’re told that we will arrive by 7:40 with just enough time to get to our flight. Within in just moments another announcement comes over the loudspeaker explaining that the plane will not be arriving in Rio until 7:40. No weather issues, no excuses…the flight is delayed indefinitely. We’re sitting, by the way, in a terminal straight out of 1972 with formica chairs and retro grime stuck in every crevice since the place was built. Meryl goes to speak with a manager. The Gol manager has no remorse nor desire to help, so Meryl asks to speak with Delta to make them aware of our plight. The Rio Delta manager gives us contact information for the São Paulo Delta manager and informs us that a Delta representative will be waiting for us in São Paulo to escort us to the plane. In the meantime, Gol has cancelled the flight altogether and placed us on another airline that’s German, so for some reason I’m confident it will leave at the scheduled 7:15 PM departure. It does and we arrive in São Paulo at around 8:30 PM. \n\nWe run to the baggage claim dodging customs lines because we were traveling within the country. When we get to baggage claim all 11 of us begin to gather our luggage while Meryl goes to find our Delta representative. One girl leaves to enjoy São Paulo and a few of us who have our luggage find Meryl stressed and alone. She said that we should just get to the check in as soon as possible so at least some of us can catch the flight because it’s on the other side of the airport. So, Kate and I start running. We’re in terminal E and Delta check-in is at terminal A. As I dodge luggage carts and baby strollers, I finally arrive at the check-in with Kate very close behind at approximately 9:10. I speak with someone about our flight and he immediately moves us to the front to speak with a service rep. The manager is right there behind her and I tell him the other 8 of us were still gathering luggage and they’re right behind me. He says that they will be placed on an 11 PM flight that flies to NYC with a stopover in Atlanta, but Kate and I will be on this flight. As we are being handed our boarding passes, a girl from our group arrives and asks what’s up. I tell her that she needs to talk to the manager because I’m not sure if she’s gonna make it on the 9:40 flight. \n\nWe are then assisted by a Delta rep who tells us that the only way to make it through the HUGE line at International departures is to feign an injury and be pushed in a wheel chair. Kate and I decide that Kate should do it. She gets in the wheel chair and is briefed on how she must act. Whatever happens, she cannot walk or they will make us wait in line. We bypassed the International departures entrance fairly easily with the help of our trusty wheelchair pusher (who speaks no English). Then, we get to security and the guy at the metal detector won’t buy that she can’t walk at all. “No puedo,” Kate says in Spanish. Finally the Delta rep tells Kate that she can walk and assists Kate through the metal detector and back to her wheelchair. At this point, I’ve got both of our carry-ons placed on the x-ray conveyor and suddenly as my turn approaches, the metal detector breaks. I see Kate ahead of me sitting in the wheelchair with her back to me and I’m stuck. The crowd was too great to move to another line, and I felt like this would be the end. After about 3 minutes, though it seemed like an eternity, the man fixes the machine and I jump through the metal detector as quickly as possible. \n\nAs the Delta rep continues to push Kate in the wheelchair, I notice that security is no longer in sight. Kate looks up at me and says we should walk the rest of the way, and we muffle through words but clearly state, “caminar” (to walk). He asks us if we’re sure and we confirm that we are. As Kate gets up we both agree that we should continue to milk it just in case people are watching. This whole time Kate has had this drugged-up look of sickness and pain on her face brilliantly playing her part of the invalid, but when we realize that our flight is supposed to leave any moment, we quickly pick up the pace and suddenly start running to the gate which is at the very end of the terminal. \n\nWe meet one girl there from our group who left much earlier in the day to catch the 11 PM flight to Atlanta because she was going home to Texas. We describe our trip and ask her to explain what happened to the others if they make it on that flight with her. I still don’t know if they did or not. Well, we finally board our plan with this sigh of relief and elated giddiness in our hearts, not because we left our group behind, but because we can finally go home and no longer be stuck in an airport for hours and hours. We are not sitting near each other, so I go to find Kate at her seat on the plane and she’s sitting in the middle of the middle three seats between two really fat men. She looks like a sardine and I can’t help but laugh at the irony. Chalk it up to Karma she says. Fortunately, one of the large men’s wife was sitting in a different seat and wanted to sit with him, so Kate was able to sit in the very last seat in the back of the plane. \n\nMy flight was pleasant, I got to see Blades of Glory and was hit on by both flight attendants along my aisle: \"What would you like to drink? There is a complimentary alcoholic beverage tonight: beer, wine, cocktails…\" she trails off in her accented English.\n \"I’ll have apple juice,\" I reply. \"I don’t drink alcohol.\" \n\"You don’t? Are you married?\" \n\"Uh…no.\" \n\"You are my perfect man? A man who doesn’t drink.\" She gives me this look as though I’m Prince Charming and I sheepishly accept my apple juice and turn my iPod back on. (God bless earphones when you don’t want to talk to someone). \n\nLater, the other flight attendant comes by to pick up my trash and stops at me to have a little conversation. Crouching he says, \"Where are you from?\" \n\"Originally, Las Vegas, but I live in NYC now,\" I reply \n\"How long were you in Brazil?\" \n\"Only three weeks. I was on a study abroad.\" \n\"So you weren’t able to learn any Portuguese,\" replies the young Brazilian. \n\"I learned a few phrases: obrigado, tchau, so cu (and I give him 5 followed by some knuckle or a pound, or whatever people are calling it these days), com licensa (which I used abundantly in my flight through the airport terminals), donde o banhero , voce é muito lindo, e tira a ruopa.\" \n(Translation: thank you, bye, gimme some knuckle, excuse me, where’s the bathroom, you’re very handsome, and take your clothes off.) \nNow, I realize the final two phrases are scandalous to say the least, but those were the phrases I learned, and I couldn’t pass up my final opportunity to speak Portuguese. \nHe laughs and asks, \"I bet those phrases came in very handy on your trip\" \n\"Very!\" Then I told him where I learned the last two phrases and we laughed. \n\nBasically the rest of the flight found me very catered to. My marriage proposal flight attendant made me a breakfast cocktail of orange juice and cranberry juice that she prepared special for me since I don’t drink, and the other one brought me water whenever I asked. My mom always said these looks would get me somewhere some day…thanks, Mom. \n\nP.S. It turns out that 7 other girls were stuck in the airport overnight and caught a flight on Tam the next morning. Best of luck to those who wish to fly in Brazil, and all joking aside, the runways are a bit too short as we all learned from the tragic accident only a few days after my return from the country. I would suggest you find different means of travel once you get to the country should you choose to visit.","image":"uploads/brazilflight.jpeg","date_added":"July 23, 2007"}]